CRUD-general-purpose/ranking_batch-0_mongodb-50-vanilla-dbaas-large-large-msazure-2022_0_biK5p0Ne/0_load.txt
/usr/java/bin/java -XX:MaxRAMPercentage=85.0 -cp /binary/ycsb/mongodb-binding/conf:/binary/ycsb/conf:/binary/ycsb/lib/core-0.17.0.jar:/binary/ycsb/lib/HdrHistogram-2.1.4.jar:/binary/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/binary/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/binary/ycsb/lib/jackson-core-asl-1.9.4.jar:/binary/ycsb/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/binary/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/binary/ycsb/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/binary/ycsb/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/binary/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/binary/ycsb/mongodb-binding/lib/slf4j-api-1.7.25.jar:/binary/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -p mongodb.url=mongodb://benchant:baas2020@benchant-cluster-shard-00-00.5nzou.mongodb.net:27017,benchant-cluster-shard-00-01.5nzou.mongodb.net:27017,benchant-cluster-shard-00-02.5nzou.mongodb.net:27017/?ssl=true&authSource=admin&replicaSet=atlas-lj2kxx-shard-0&maxPoolSize=200 -p batchsize=10 -p workload=site.ycsb.workloads.CoreWorkload -threads 200 -p recordcount=5000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=50 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
Command line: -db site.ycsb.db.MongoDbClient -s -p mongodb.url=mongodb://benchant:baas2020@benchant-cluster-shard-00-00.5nzou.mongodb.net:27017,benchant-cluster-shard-00-01.5nzou.mongodb.net:27017,benchant-cluster-shard-00-02.5nzou.mongodb.net:27017/?ssl=true&authSource=admin&replicaSet=atlas-lj2kxx-shard-0&maxPoolSize=200 -p batchsize=10 -p workload=site.ycsb.workloads.CoreWorkload -threads 200 -p recordcount=5000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=50 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
YCSB Client 0.17.0

Loading workload...
Starting test.
2022-04-01 16:53:25:465 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://benchant:baas2020@benchant-cluster-shard-00-00.5nzou.mongodb.net:27017,benchant-cluster-shard-00-01.5nzou.mongodb.net:27017,benchant-cluster-shard-00-02.5nzou.mongodb.net:27017/?ssl=true&authSource=admin&replicaSet=atlas-lj2kxx-shard-0&maxPoolSize=200
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2022-04-01 16:53:35:410 10 sec: 283840 operations; 28381.16 current ops/sec; est completion in 2 minutes [INSERT: Count=283840, Max=6213631, Min=1, Avg=6725.16, 90=580, 99=57631, 99.9=74815, 99.99=5758975] 
2022-04-01 16:53:45:410 20 sec: 736050 operations; 45221 current ops/sec; est completion in 1 minute [INSERT: Count=452210, Max=114943, Min=1, Avg=4417.01, 90=1006, 99=63039, 99.9=85439, 99.99=99519] 
2022-04-01 16:53:55:410 30 sec: 1088930 operations; 35288 current ops/sec; est completion in 1 minute [INSERT: Count=352880, Max=1598463, Min=1, Avg=5476.77, 90=13439, 99=61855, 99.9=86079, 99.99=1558527] 
2022-04-01 16:54:05:410 40 sec: 1334637 operations; 24570.7 current ops/sec; est completion in 1 minute [INSERT: Count=245720, Max=2363391, Min=1, Avg=8418.56, 90=6247, 99=64159, 99.9=2053119, 99.99=2355199] 
2022-04-01 16:54:15:410 50 sec: 1765990 operations; 43135.3 current ops/sec; est completion in 1 minute [INSERT: Count=431340, Max=122623, Min=1, Avg=4631.86, 90=900, 99=67455, 99.9=94783, 99.99=109311] 
2022-04-01 16:54:25:410 60 sec: 1961110 operations; 19512 current ops/sec; est completion in 1 minute [INSERT: Count=195120, Max=1884159, Min=1, Avg=8694.39, 90=3345, 99=71103, 99.9=1656831, 99.99=1842175] 
2022-04-01 16:54:35:410 70 sec: 2374600 operations; 41349 current ops/sec; est completion in 1 minute [INSERT: Count=413520, Max=2740223, Min=1, Avg=5568.95, 90=5151, 99=58495, 99.9=174847, 99.99=2725887] 
2022-04-01 16:54:45:410 80 sec: 2776650 operations; 40205 current ops/sec; est completion in 1 minute [INSERT: Count=402020, Max=1397759, Min=1, Avg=4968.93, 90=5019, 99=60063, 99.9=96959, 99.99=1393663] 
2022-04-01 16:54:55:410 90 sec: 3219780 operations; 44313 current ops/sec; est completion in 50 seconds [INSERT: Count=443271, Max=107135, Min=1, Avg=4516.91, 90=14959, 99=62943, 99.9=79423, 99.99=92223] 
2022-04-01 16:55:05:410 100 sec: 3457850 operations; 23807 current ops/sec; est completion in 45 seconds [INSERT: Count=237929, Max=2004991, Min=1, Avg=7665.36, 90=3037, 99=67775, 99.9=1595391, 99.99=2000895] 
2022-04-01 16:55:15:410 110 sec: 3832680 operations; 37483 current ops/sec; est completion in 34 seconds [INSERT: Count=374830, Max=1951743, Min=1, Avg=5782.44, 90=4643, 99=69247, 99.9=251391, 99.99=1941503] 
2022-04-01 16:55:25:410 120 sec: 4059480 operations; 22680 current ops/sec; est completion in 28 seconds [INSERT: Count=226820, Max=2258943, Min=1, Avg=8848.56, 90=3539, 99=63327, 99.9=1884159, 99.99=2254847] 
2022-04-01 16:55:35:410 130 sec: 4280010 operations; 22053 current ops/sec; est completion in 22 seconds [INSERT: Count=220510, Max=3014655, Min=1, Avg=9062.5, 90=856, 99=68863, 99.9=1718271, 99.99=2295807] 
2022-04-01 16:55:45:410 140 sec: 4728320 operations; 44831 current ops/sec; est completion in 9 second [INSERT: Count=448310, Max=701439, Min=1, Avg=4453.26, 90=4053, 99=60223, 99.9=86591, 99.99=690175] 
2022-04-01 16:55:51:905 146 sec: 5000000 operations; 41829.1 current ops/sec; [CLEANUP: Count=200, Max=13255, Min=0, Avg=67.74, 90=3, 99=7, 99.9=13255, 99.99=13255] [INSERT: Count=271680, Max=119359, Min=1, Avg=3644.19, 90=13135, 99=54879, 99.9=76991, 99.99=103039] 
[OVERALL], RunTime(ms), 146495
[OVERALL], Throughput(ops/sec), 34130.85770845421
[TOTAL_GCS_PS_Scavenge], Count, 28
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 146
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.09966210450868632
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 28
[TOTAL_GC_TIME], Time(ms), 146
[TOTAL_GC_TIME_%], Time(%), 0.09966210450868632
[CLEANUP], Operations, 200
[CLEANUP], AverageLatency(us), 67.74
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 13255
[CLEANUP], 95thPercentileLatency(us), 3
[CLEANUP], 99thPercentileLatency(us), 7
[INSERT], Operations, 5000000
[INSERT], AverageLatency(us), 5777.545743
[INSERT], MinLatency(us), 1
[INSERT], MaxLatency(us), 6213631
[INSERT], 95thPercentileLatency(us), 40479
[INSERT], 99thPercentileLatency(us), 63359
[INSERT], Return=OK, 500000
[INSERT], Return=BATCHED_OK, 4500000